# specify directory to install
cask_args appdir: "/Applications"

# install packages + some apps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# Brew install terminal apps and services
brew "git"
brew "gh"
brew "postgresql"
brew "rbenv"
brew "vips"
Brew "flyctl"

# Casks - GUI apps
cask "brave-browser"
cask "discord"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "linear"
cask "macvim"
cask "notion"
cask "obsidian"
cask "plex-media-server"
cask "postman"
cask "slack"
cask "stats"
cask "toggl-track"
cask "transmission"
cask "raycast"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Fonts